AOS.init({
    easing: 'ease-out-back',
    duration: 1000
});
 const main = document.querySelectorAll(".main");
 const all = document.querySelector("#all");
 const about = document.querySelector("#about");
 const head = document.querySelector("head");
 console.log(about);
 const data = [
    {
        h1: "WEB (HTML, CSS, JavaScript)",
        h3 : `"Մտքի Բանալի" ուսումնական կենտրոնը համատեղ WebEX ընկերության հետ կազմակերպում են WEB ծրագրավորման դասընթացներ։
        <br><br>
        •	Դասընթացը ներառում է՝ HTML, CSS, JavaScript<br>
        •	նախնական գիտելիք չի պահանջվում 0-ից՝ մինչև հմուտ մասնագետ<br>
        •	Յուրաքանչյուր մասնակից ստանում է առանձնահատուկ վերաբերմունք<br>
        •	Խմբում 3-6 մասնակից<br>
        <br>
        Դասընթացը նախատեսված է նրանց համար, ովքեր ցանկանում են խորացված գիտելիք ձեռք բերե WEB ծրագրավորման մեջ,որը այսօրվա աշխատաշուկայում ամենապահանջված հմտություններից մեկն է։
        <br>
        Դասընթացը շաբաթը 3 անգամ է:<br>
        Արժեքը ամիսը 40000դր.`,
        img : "img0",
        time : "16 շաբաթ",
        count : "4 ժամ/շաբաթ",
        price : "40.000 ՀՀ դրամ"
    },
    {
        h1 : "AutoCAD",
        h3 : `Այս դասընթացը նախատեսված է ինչպես սկսնակների, այնպես էլ տվյալ ոլորտում տարբեր մակարդակների գիտելիքներ ունեցող անձանց համար:<br>
        Դասընթացի արդյունքում կսովորեք՝ <br>AutoCAD ծրագրի հիմնային կոնցեպտները,  կկարողանաք ստեղծել ցանկացած բարդության և բնույթի օբյեկտների նախագծեր (երկչափ և եռաչափ):
        <br><br>
        AutoCAD-ը ժամանակակից CAD է գծագրերի և եռաչափ մոդելների ստեղծման համար, որոնք առավել ճշգրիտ և արդյունավետ են մասնագիտացված գործառույթների շնորհիվ, որոնք ուղղված են մեքենաշինության, ճարտարապետության, էլեկտրատեխնիկայի և այլ ոլորտների նախագծերի ստեղծմանը:
        <br><br>
        Դասընթացը ներառում է 12 դաս:<br>
        Արժեքը խմբային դասի դեպքում 30000դր. Անհատական 40000 դր.`,
        img : "learning_47ecfab97305694550f17b4df65444c8",
        time : "6 շաբաթ",
        count : "4 ժամ/շաբաթ",
        price : "30.000 ՀՀ դրամ"
    },
    {
        h1 : "Անգլերեն լեզու",
        h3 : `"Մտքի Բանալի" ուսումնական կենտրոնը հրավիրում է անգլերեն լեզվի դասընթացի, որը նախատեսված է բոլոր մակարդակների համար: 
        <br><br>
        Դասընթացի արդյունքում՝<br>
        •	Կբարելավեք Ձեր անգլերենի մակարդակը:<br>
        •	Ձեռք կբերեք անգլերենի հարուստ բառապաշար, լսողական և խոսակցական հմտություններ:<br>
        •	Հեշտորեն կսովորեք քերականությունը<br>
        •	Խմբում 3-6 մասնակից։<br><br>
        Դասընթացը շաբաթը 3 անգամ է:<br>
        Արժեքը խմբային դասի դեպքում 15000դր. Անհատական 30000 դր.
        `,
        img : "english",
        time : "16 շաբաթ",
        count : "6 ժամ/շաբաթ",
        price : "15.000 ՀՀ դրամ"
    },
    {
        h1 : "Շախմատ",
        h3 : `Քանի որ շախմատը շատ հին ու լայնորեն տարածված խաղ է, <br>գոյություն ունեն ապացուցված հիմունքների և ռազմավարությունների մի ամբողջ շարք լավ շախմատիստ լինելու համար։ <br>
        Անկախ նրանից, թե խաղի որ ասպեկտ է ձեզ հետաքրքրում "Մտքի Բանալի"-ն ունի դասընթաց, որը կօգնի ձեզ հաղթել։<br>
        <br><br>
        •	7-10 տարեկան երեխաներին հնարավորություն կտա ամրացնել և լրացնել իրենց շախմատային գիտելիքները, որը կօգնի հետագա դպրոցի շախմատի դասերին<br>
        •	Կստեղծի կայուն գիտելիքների բազա, հետագա պրոֆեսիոնալ շախմատի համար<br>
        •	Ամեն խմբում 6 երեխա<br>
        <br>
        <br>
        Դասընթացը շաբաթը 2 անգամ է:<br>
        Արժեքը ամիսը 16000դր<br>
        `,
        img : "python",
        time : "16 շաբաթ",
        count : "4 ժամ/շաբաթ",
        price : "16.000 ՀՀ դրամ" 
    },
    {
        h1 : `SCRATCH – ծրագրավորում երեխաների համար`,
        h3 : `•	Մարդիկ օգտագործում են գիրը կյանքի տարբեր ոլորտներում. նամակ գրելիս, աշխատելիս և այլն։<br> Գրելը նաեւ մարդկանց ներգրավում է նոր մտածողության մեջ։<br> Գրելիս սովորում ենք կազմակերպել,կատարելագործել և արտացոլել մեր գաղափարները։
        <br><br>
        Կոդավորումը (համակարգչային ծրագրավորումը) գրության ընդլայնում է։ <br>Այն թույլ է տալիս "գրել" նոր տեսակի բաներ. խաղեր, անիմացիաներ, ինտերակտիվ պատմություններ։<br>
        •	Անկախ նրանից, թե ինչպիսին են Ջեր ծրագրավորման նպատակները, սկսելու լավագույն տեղը ամուր հիմք կառուցելն է։<br>
        <br><br>
        Այս դասընթացներից կսովորեք.<br>
        •	մտածել և կոդավորել մասնագետի պես։<br>
        •	համակարգչային գիտության հիմունքներ։<br>
        •	կրեատիվ և ալգորիթմական մտածողություն<br>
        •	թիմում աշխատելու ունակություն։<br>
        <br><br>
        Դասընթացը շաբաթը 2 անգամ է:<br>
        Արժեքը ամիսը 16000դր.
        `,
        img : "scratch",
        time : "16 շաբաթ",
        count : "4 ժամ/շաբաթ",
        price : "16.000 ՀՀ դրամ" 
    },

 ];
 main.forEach((item, index)=> {
    item.addEventListener("click", () =>{
        const info = document.createElement("div");
        info.id = "thiscourse"
        info.innerHTML = `
        <div id="info0">
                <div><h1 class="h1">${data[index].h1}</h1>
                    <h3 class="h3">${data[index].h3}</h3></div>
                <div>
                    <img class="img" src="IMG/${data[index].img}.jpg" type="image/jpg">
                    <div class="imgclass">
                        <button id="joinbut" ><a style="color:black" href="https://mail.google.com/mail/u/0/#inbox?compose=GTvVlcSKkkJnMcZBrdZtjcTmmlkjwQFwcQxPjXhSqDgLGpKXQwggzbqVtmwvJtSqZkfhfhGsmXrxM" target="_blank">ԳՐԱՆՎԵԼ</a></button>
                    </div>
                    </div>
                
            </div>
            <div id="info1">
                <div>Տևողություն<p>${data[index].time}</p></div>
                <div>Մակարդակ<p>Հիմունքներ</p></div>
                <div>Տեսակ<p>Լսարանային</p></div>
                <div>Դասաժամեր<p>${data[index].count}</p></div>
                <div>Գինը<p>${data[index].price}</p></div>
            </div>
        `
        head.innerHTML += `<link rel="stylesheet" type="text/css" href="CSS/other.css"></link>`
        all.replaceWith(info);
     })
 })
about.addEventListener("click", () => {
    const ourinfo = document.createElement('div');
    ourinfo.id = "ourinfo";
    ourinfo.innerHTML =  `
            <h1 id = "h1">Մեր պատմությունը</h1>
            <h5 id = "h5">«Մտքի Բանալի» ուսումնական կենտրոնը, հիմնադրվել է 2022թ. Հունվարին, նպատակ ունենալով զարգացնել երեխաների կենտրոնացումը և ուշադրությունը, կրեատիվ և ալգորիթմական մտածողությունը, թիմում աշխատելու ունակությունը, կիրթ հաղորդակցվելու շնորհը:
                Երեխաներին ծանոթացնում ենք ապագայի մասնագիտություններին, նրանց հետագա կողմնորոշումը հեշտացնելու համար:
                Մեծերին օգնում ենք սովորել հիմունքներ  այսօրվա արդիական մասնագիտություններում:
                Դասերը կազմակերպում ենք հնարավորինս մատչելի և որակով:<br><br>
                Մեր ուղղվածությունը՝<br>
                •	Ինժեներատեխնիկական<br>
                •	Թվային տեխնոլոգիաներ<br>
                •	Օտար լեզուներ<br>
                •	Սցենարական արվեստ և խոսքի կուլտուրա<br>
                <br>
                Դասընթացները՝<br>
                •	AutoCAD<br>
                •	Ծրագրավորում<br>
                •	Ռոբոտաշինություն<br>
                •	Օտար լեզուներ<br>
                •	Շախմատ<br>
                •	Մենթալ թվաբանություն<br>
                •	Օպերատորություն, սցենար, ռեժիսուրա<br>
                •	Խոսքի կուլտուրա<br>
                •	Manual QA<br>
                </h5>
    `;
    ourinfo.style.cssText = `
        width: 50%;
        margin: auto auto;
    
    `;
    ourinfo.childNodes[1].style.cssText = `
        font-size: 50px;
        text-align: center;
    `;
    ourinfo.childNodes[3].style.cssText = `
        font-size: 20px;
        text-align: start;
        font-family: Arial, Helvetica, sans-serif;
    `
    all.replaceWith(ourinfo);
    

})
